In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
titanic = sns.load_dataset('titanic')
sns.set()

titanic['fareclass'] = titanic['class']
titanic = titanic.drop(columns = ['class'])
print(titanic) #drop 'class' because it clashes with keyword 'class'

#calculate survival rate of people of different gender and class
print(titanic.pivot_table('survived',index='sex',columns = 'fareclass')) 

#gets the survived of first class females
titanic.query("(fareclass == 'First') and (sex == 'female')")['survived']

     survived  pclass     sex   age  sibsp  parch     fare embarked    who  \
0           0       3    male  22.0      1      0   7.2500        S    man
1           1       1  female  38.0      1      0  71.2833        C  woman
2           1       3  female  26.0      0      0   7.9250        S  woman
3           1       1  female  35.0      1      0  53.1000        S  woman
4           0       3    male  35.0      0      0   8.0500        S    man
..        ...     ...     ...   ...    ...    ...      ...      ...    ...
886         0       2    male  27.0      0      0  13.0000        S    man
887         1       1  female  19.0      0      0  30.0000        S  woman
888         0       3  female   NaN      1      2  23.4500        S  woman
889         1       1    male  26.0      0      0  30.0000        C    man
890         0       3    male  32.0      0      0   7.7500        Q    man

     adult_male deck  embark_town alive  alone fareclass
0          True  NaN  Southampton    no  False     Third
1         False    C    Cherbourg   yes  False     First
2         False  NaN  Southampton   yes   True     Third
3         False    C  Southampton   yes  False     First
4          True  NaN  Southampton    no   True     Third
..          ...  ...          ...   ...    ...       ...
886        True  NaN  Southampton    no   True    Second
887       False    B  Southampton   yes   True     First
888       False  NaN  Southampton    no  False     Third
889        True    C    Cherbourg   yes   True     First
890        True  NaN   Queenstown    no   True     Third

[891 rows x 15 columns]
fareclass     First    Second     Third
sex
female     0.968085  0.921053  0.500000
male       0.368852  0.157407  0.135447

1      1
3      1
11     1
31     1
52     1
      ..
856    1
862    1
871    1
879    1
887    1
Name: survived, Length: 94, dtype: int64

In [2]:
age_array = titanic['age'].dropna().unique()
# for i in age_array:
#     print(i)
# print("_________")

# for i in sorted(age_array):
#     print(i)
# print("_________")

age = pd.cut(titanic['age'],[0,18,80])
#no. of survived
print(titanic.pivot_table('survived',['sex',age],'fareclass',aggfunc = 'count'))
#rate of survival 
print(titanic.pivot_table('survived',['sex',age],'fareclass'))

fareclass        First  Second  Third
sex    age
female (0, 18]      11      14     43
       (18, 80]     74      60     59
male   (0, 18]       5      15     51
       (18, 80]     96      84    202
fareclass           First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663